package registry

public enum Speciality {


    S0('Педiатр'),
    S1('Хірург'),
    S2('Ортопед'),
    S3('Гінеколог'),
    S4('Отоларинголог (ЛОР)'),
    S5('Фізіотерапевт'),
    S6('ЛФК'),
    S7('Гельмінтолог'),
    S8('Офтальмолог'),
    S9('Кардіолог'),
    S10('Ендокринолог'),
    S11('Невропатолог'),
    S12('Психіатр'),
    S13('Пульмонолог'),
    S14('Алерголог'),
    S15('Гастроентеролог'),
    S16('Інфекціоніст'),
    S17('Гематолог'),
    S18('Нефролог'),
    S19('Логопед'),
    S20('Психолог'),
    S21('ЕКГ'),
    S22('Рентген'),
    S23('Ендоскопія'),
    S24('Психолог КДМ');

    String name

    Speciality(String name) {
        this.name = name
    }

    public String getName() {
        return name
    }

}